In [9]:
import pandas as pd

In [10]:
df_ramen=pd.read_csv('ramen-ratings.csv')
df_ramen.head()

,Brand,Variety,Style,Country,Stars
0,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75
1,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1.00
2,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25
3,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75
4,Ching's Secret,Singapore Curry,Pack,India,3.75

In [11]:
#1. Group the data and get the average of the groups to produce a DataFrame that looks like this:
grouped_cols=df_ramen.groupby(['Country','Brand','Style'])
average_col=grouped_cols[['Stars']].mean()
average_col.head()

                              Stars
Country   Brand     Style
Australia Fantastic Cup    3.041667
          Maggi     Pack   5.000000
          Singa-Me  Cup    2.833333
          Suimin    Cup    3.287500
          Trident   Pack   2.750000

In [12]:
#2. Group the data in the same way, but this time get both the average and the count.
grouped_cols=df_ramen.groupby(['Country','Brand','Style'],observed=True)
aggregate_cols=grouped_cols[['Stars']].agg(['mean','count'])
aggregate_cols.head()

                              Stars
                               mean count
Country   Brand     Style
Australia Fantastic Cup    3.041667     6
          Maggi     Pack   5.000000     1
          Singa-Me  Cup    2.833333     3
          Suimin    Cup    3.287500     8
          Trident   Pack   2.750000     4

In [13]:
#3.Create a pivot table that shows the average stars by ramen style for each country.
df_ramen.pivot_table(index='Country',columns='Style',values='Stars',aggfunc='mean').head()

Style       Bar     Bowl  Box  Can       Cup      Pack  Tray
Country
Australia   NaN      NaN  NaN  NaN  3.120588  3.200000   NaN
Bangladesh  NaN      NaN  NaN  NaN       NaN  3.714286   NaN
Brazil      NaN      NaN  NaN  NaN  4.500000  4.250000   NaN
Cambodia    NaN      NaN  NaN  NaN       NaN  4.200000   NaN
Canada      NaN  2.28125  NaN  NaN  1.970588  2.515625   NaN

In [14]:
#4. Calculate the total number of stars for each country, and then 
# rank the countries in descending order by total stars. 
total_stars = df_ramen.groupby('Country')['Stars'].sum().reset_index()
total_stars_sorted = total_stars.sort_values(by='Stars', ascending=False)
total_stars_sorted.head()

        Country     Stars
18        Japan  1401.525
30  South Korea  1163.700
35          USA  1116.625
32       Taiwan   821.050
33     Thailand   646.500

In [15]:
#5. Bin the stars data into 11 bins. Label the bins from 0.0 to 5.0 in increments of .5, and
# then display the count of the stars in each bin
# Cut the stars into bins
df_ramen['Stars_bin'] = pd.cut(df_ramen['Stars'], 
    bins=[0.0,0.5,1.0,1.5,2.0,2.5,3.0,3.5,4.0,4.5,5.0,5.5], 
    labels=['0.0','0.5','1.0','1.5','2.0','2.5','3.0','3.5','4.0','4.5','5.0'])

# Display count per bin
df_ramen['Stars_bin'].value_counts().sort_index()

Stars_bin
0.0     26
0.5     28
1.0     49
1.5     96
2.0     92
2.5    266
3.0    511
3.5    749
4.0    284
4.5    450
5.0      0
Name: count, dtype: int64

In [19]:
#6. Bin the stars data into five quantiles. Give each bin a descriptive label, and 
# then display the count of the stars in each bin.  

df_ramen['Stars_quantile'] = pd.qcut(df_ramen['Stars'], q=5, 
            labels=['Very Low', 'Low', 'Medium', 'High', 'Very High'])
df_ramen['Stars_quantile'].value_counts().sort_index()

Stars_quantile
Very Low     583
Low          511
Medium       749
High         284
Very High    450
Name: count, dtype: int64

In [17]:
#7. Which five countries have the most stars overall? Hint: Use the grouped data from Question 5.
# This question must be answered with code.
top5_countries = total_stars_sorted.head(5)
top5_countries

        Country     Stars
18        Japan  1401.525
30  South Korea  1163.700
35          USA  1116.625
32       Taiwan   821.050
33     Thailand   646.500

In [20]:
#8. What is the only country that produces canned ramen. This question must be answered with code. 
canned_country = df_ramen.loc[df_ramen['Style'] == 'Can', 'Country'].unique()
canned_country

array(['USA'], dtype=object)